duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
/****************************************Copyright (c)************************************************
** File Name:			    codetrans.c
** Descriptions:			Key message process source file
** Created By:				xie biao
** Created Date:			2020-12-28
** Modified Date:      		2020-12-28 
** Version:			    	V1.0
******************************************************************************************************/
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <zephyr.h>
#include <soc.h>
#include <device.h>
#include <drivers/gpio.h>
#include <logging/log.h>
#include <nrfx.h>
#include "codetrans.h"
#include "CharsetTable.h"

#include <logging/log_ctrl.h>
#include <logging/log.h>
LOG_MODULE_REGISTER(codetrans, CONFIG_LOG_DEFAULT_LEVEL);

/* Handling UCS2 string not aligned with 2 bytes. (Obigo adopts UTF8 by default) */
#define MMI_CHSET_DBG_ASSERT(_expr)
// #define MMI_CHSET_UTF8_FAULT_TOLERANT
#define MMI_CHSET_UTF8_ALLOW_BOM
#define CAST_PU8(RAW)   ((u8_t*)(RAW))
#define CAST_CPU8(RAW)  ((const u8_t*)(RAW))
#define GET_U8_BYTE_TO_U16(RAW, i)  ((u16_t)(CAST_CPU8(RAW)[i]))
#define STR_SIZE(len) ((len)<<1)
#define STR_AT(RAW, n) ((void*)(CAST_PU8(RAW)+STR_SIZE(n)))
#define CHR_AT(RAW, n) ((u16_t)(GET_U8_BYTE_TO_U16(RAW, STR_SIZE(n))+(GET_U8_BYTE_TO_U16(RAW, STR_SIZE(n)+1)<<8)))
#define SET_CHR_AT(RAW, n, value)   do {                          \
                              u8_t *_p = STR_AT(RAW, n);     \
                              u16_t v= (u16_t) (value); \
                              _p[0] = (u8_t) (v & 0xff);     \
                              _p[1] = (u8_t) (v >> 8);       \
                           } while (0)
#define CHR(x)      ((u16_t)(x))

#define INVERSE_HIGH_LOW_BYTE(x) (((x) >> 8) | (((x) & 0xff)<<8))

#define MERGE_TO_WCHAR(high, low)  (high << 8) + ((u8_t)low)
#define UTF16_HIGH_START      0xD800
#define UTF16_HIGH_END        0xDBFF
#define UTF16_LOW_START       0xDC00
#define UTF16_LOW_END         0xDFFF

static bool g_chset_tbl_is_init = false;
static mmi_chset_info_struct* g_chset_tbl[CHSET_PAIR_TOTAL] = {0};


#ifdef __MMI_CHSET_IDEOGRAM_SUPPORT__
const key_index_t *g_chset_ucs2_to_encode_key_LSB_index[NO_OF_TEXT_ENCODING] = 
{
#ifdef __MMI_CHSET_BIG5__
    g_chset_ucs2_to_big5_key_LSB_index,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_GB2312__
    g_chset_ucs2_to_gb2312_key_LSB_index,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_HKSCS__
    g_chset_ucs2_to_hkscs_key_LSB_index
#else 
    NULL
#endif 
};

const key_index_t *g_chset_encode_to_ucs2_key_LSB_index[NO_OF_TEXT_ENCODING] = 
{
#ifdef __MMI_CHSET_BIG5__
    g_chset_big5_to_ucs2_key_LSB_index,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_GB2312__
    g_chset_gb2312_to_ucs2_key_LSB_index,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_HKSCS__
    g_chset_hkscs_to_ucs2_key_LSB_index
#else 
    NULL
#endif 
};

const u8_t *g_chset_ucs2_to_encode_key_MSB[NO_OF_TEXT_ENCODING] = 
{
#ifdef __MMI_CHSET_BIG5__
    g_chset_ucs2_to_big5_key_MSB,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_GB2312__
    g_chset_ucs2_to_gb2312_key_MSB,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_HKSCS__
    g_chset_ucs2_to_hkscs_key_MSB
#else 
    NULL
#endif 
};

const u8_t *g_chset_encode_to_ucs2_key_MSB[NO_OF_TEXT_ENCODING] = 
{
#ifdef __MMI_CHSET_BIG5__
    g_chset_big5_to_ucs2_key_MSB,
#else 
    NULL,
#endif 
    NULL, //new struct for gb2312 MSB table
#ifdef __MMI_CHSET_HKSCS__
    g_chset_hkscs_to_ucs2_key_MSB
#else 
    NULL
#endif 
};

const u16_t *g_chset_ucs2_to_encode_table[NO_OF_TEXT_ENCODING] = 
{
#ifdef __MMI_CHSET_BIG5__
    g_chset_ucs2_to_big5_table,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_GB2312__
    g_chset_ucs2_to_gb2312_table,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_HKSCS__
    g_chset_ucs2_to_hkscs_table
#else 
    NULL
#endif 
};

const u16_t *g_chset_encode_to_ucs2_table[NO_OF_TEXT_ENCODING] = 
{
#ifdef __MMI_CHSET_BIG5__
    g_chset_big5_to_ucs2_table,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_GB2312__
    g_chset_gb2312_to_ucs2_table,
#else 
    NULL,
#endif 
#ifdef __MMI_CHSET_HKSCS__
    g_chset_hkscs_to_ucs2_table
#else 
    NULL
#endif 
};

const u16_t g_chset_unknown_encode_char_no_space[] = 
{
    0xFFFF,
    0xFFFF,
    0xFFFF
};

const u16_t g_chset_unknown_encode_char_space[] = 
{
    0x20,
    0x20,
    0x20
};

const u16_t *g_chset_unknown_encode_char = g_chset_unknown_encode_char_no_space;
#endif /* __MMI_CHSET_IDEOGRAM_SUPPORT__ */ 

static const u8_t g_cheset_utf8_bytes_per_char[16] = 
{
    1, 1, 1, 1, 1, 1, 1, 1,
    0, 0, 0, 0, 2, 2, 3, 4  /* we don't support UCS4 */
};

const u8_t g_chset_state[] = 
{
    0,
    1,  /* MMI_CHSET_ASCII */

#ifdef __MMI_CHSET_WESTERN_WIN__
    1,
#else 
    0,
#endif 

#ifdef __MMI_CHSET_BIG5__
    1,
#else 
    0,
#endif 

#ifdef __MMI_CHSET_GB2312__
    1,
#else 
    0,
#endif 

#ifdef __MMI_CHSET_HKSCS__
    1,
#else 
    0,
#endif 

#ifdef __MMI_CHSET_SJIS__
    1,
#else 
    0,
#endif 

#ifdef __MMI_CHSET_GB18030__
    1,
#else 
    0,
#endif 

#ifdef __MMI_CHSET_UTF7__
    1,
#else
    0,
#endif

    /* PLace all encodings using algo to above this one */
    1,  /* MMI_CHSET_UTF16LE, */
    1,  /* MMI_CHSET_UTF16BE, */
    1,  /* MMI_CHSET_UTF8, */
    1,  /* MMI_CHSET_UCS2, */
    1   /* MMI_CHSET_TOTAL */
};


#ifdef MMI_CHSET_UTF8_ALLOW_BOM
/*****************************************************************************
 * FUNCTION
 *  mmi_chset_is_utf8_BOM
 * DESCRIPTION
 *  
 * PARAMETERS
 *  str     [IN]        
 * RETURNS
 *  
 *****************************************************************************/
static bool mmi_chset_is_utf8_BOM(const u8_t *str)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (str[0] == 0xEF && str[1] == 0xBB && str[2] == 0xBF)
    {
        return true;
    }
    else
    {
        return false;
    }
}
#endif /* MMI_CHSET_UTF8_ALLOW_BOM */ 

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_get_utf_byte_order
 * DESCRIPTION
 *  The function is used for get the byte order via the byte order mark .
 * PARAMETERS
 *  str_bom     [IN]        The byte order mark.
 * RETURNS
 *  returns MMI_CHSET_UTF16LE if the stream is little-endian
 *  returns MMI_CHSET_UTF16BE if the stream is big-endian
 *  returns MMI_CHSET_UTF8 if the input BOM is a UTF-8's BOM
 *  Otherwise returns -1
 *****************************************************************************/
s8_t mmi_chset_get_utf_byte_order(const s8_t *str_bom)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u16_t wc;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    wc = MERGE_TO_WCHAR(str_bom[0], str_bom[1]);

    switch (wc)
    {
    case 0xFFFE:
        return MMI_CHSET_UTF16LE;

    case 0xFEFF:
        return MMI_CHSET_UTF16BE;

