duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    case 0xEFBB:
        if((s8_t)0xBF == str_bom[2])
            return MMI_CHSET_UTF8;
        else
            return -1;

    default:
        return -1;
    }
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_binary_search
 * DESCRIPTION
 *  Binary search MSB index in the mapping table
 * PARAMETERS
 *  key                 [IN]        value to find
 *  lookup_table        [IN]        lookup table
 *  start               [IN]        start index
 *  end                 [IN]        end index
 * RETURNS
 *  The MSB index in the lookup table
 *****************************************************************************/
static s16_t mmi_chset_binary_search(
                    const u8_t key,
                    const u8_t *lookup_table,
                    s16_t start,
                    s16_t end)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while (start <= end)
    {
        s16_t mid = (start + end) / 2;

        if (key > lookup_table[mid])
        {
            start = mid + 1;
        }
        else if (key < lookup_table[mid])
        {
            end = mid - 1;
        }
        else    /* key == target */
        {
            return mid;
        }
    }

    return -1;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_utf8_len
 * DESCRIPTION
 *  
 * PARAMETERS
 *  ucs2        [IN]        
 * RETURNS
 *  
 *****************************************************************************/
static int mmi_chset_ucs2_to_utf8_len(u16_t ucs2)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (ucs2 < (u16_t)0x80)
    {
        return 1;
    }
    else if (ucs2 < (u16_t)0x800)
    {
        return 2;
    }
    else
    {
        return 3;
    }
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_copy_to_dest
 * DESCRIPTION
 *  When the source charset type equals to dest charset type, copy source to dest directly
 * PARAMETERS
 *  src_type        [IN]        Charset type of source
 *  src_buff        [IN]        Buffer stores source string
 *  dest_buff       [OUT]       Buffer stores destination string
 *  dest_size       [IN]        Size of destination buffer (bytes)
 *  src_end_pos     [OUT]       
 * RETURNS
 *  Bytes copied
 *****************************************************************************/
s32_t mmi_chset_copy_to_dest(
            ENUM_MMI_CHSET src_type,
            u8_t *src_buff,
            u8_t *dest_buff,
            s32_t dest_size,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t WordBytes = 0;
    ENUM_MMI_CHSET_PAIR Scheme;
    s32_t count = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if(src_type == MMI_CHSET_UCS2)
    {
        WordBytes = CHSET_BIT_WORD_16;
    }
    else
    {
        Scheme = (ENUM_MMI_CHSET_PAIR) (BASE_ENCODING_SCHEME + (src_type - MMI_CHSET_BASE) * 2 - 1);
		__ASSERT(Scheme < CHSET_PAIR_TOTAL, "Scheme < CHSET_PAIR_TOTAL");
        WordBytes = g_chset_tbl[Scheme]->Input_word_bits;
    }

    if(WordBytes == CHSET_BIT_WORD_16)
    {
        for (count = 0; src_buff[count] != 0 || src_buff[count + 1] != 0; count = count + 2)
        {
            if (count >= dest_size - 2)
            {
                count = (u16_t)dest_size - 2;
                break;
            }
            dest_buff[count] = src_buff[count];
            dest_buff[count + 1] = src_buff[count + 1];
        }
        *src_end_pos = (u32_t)(src_buff + count);
        dest_buff[count] = 0;
        dest_buff[++count] = 0;
        return count + 1;
    }
    else if(WordBytes == CHSET_BIT_WORD_8)
    {
        for (count = 0; src_buff[count] != 0; count++)
        {
            if (count >= dest_size - 1)
            {
                count = (u16_t)dest_size - 1;
                break;
            }
            dest_buff[count] = src_buff[count];
        }
        *src_end_pos = (u32_t)(src_buff + count);
        dest_buff[count] = 0;
        return count + 1;
    }
    else
    {
        return 0;
    }
}

static s32_t mmi_chset_simple_convert(
			 u8_t *dest,
			 s32_t dest_size,
			 u8_t *src,
			 u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
	s32_t bytecount = 0;
    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/

    while ((*src != 0) && (bytecount+2 < dest_size))
    {
        if (*src < 0x7F)
        {
            *dest++ = *src++;
            *dest++ = 0x00;
        }
        else
        {
            *dest++ = 0x3F;
            *dest++ = 0x00;
        }
        bytecount += 2;
    }

    *src_end_pos = (u32_t)src;

