duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    *dest++ = 0x00;
    *dest = 0x00;
    return bytecount;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_ascii
 * DESCRIPTION
 *  
 * PARAMETERS
 *  encode_char     [IN]        
 *  encoding        [IN]        
 * RETURNS
 *  
 *****************************************************************************/
static u16_t mmi_chset_ucs2_to_ascii(u8_t *pOutBuffer, u8_t *pInBuffer, s32_t dest_size, u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u16_t count = 0;
    *src_end_pos = (u32_t)pInBuffer;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while (!((*pInBuffer == 0) && (*(pInBuffer + 1) == 0)) && (dest_size > count+1))
    {      
        if (((u16_t)(*pInBuffer) <= 0x7F) && ((u16_t)(*(pInBuffer+1)) == 0))
        {
            *pOutBuffer = *(pInBuffer);
        }
        else
        {
            *pOutBuffer = (char)0xFF;            
        }
        pInBuffer += 2;
        pOutBuffer++;
        count++;
    }

    *pOutBuffer = 0;
    *src_end_pos = (u32_t)pInBuffer;
	
    return count+1;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ascii_to_ucs2
 * DESCRIPTION
 *
 * PARAMETERS
 *  pOutBuffer      [OUT]  UCS2 destination string   
 *  pInBuffer       [IN]   ASCII source string  
 * RETURNS
 *  Return the bytes to convert.
 *****************************************************************************/
static u16_t mmi_chset_ascii_to_ucs2(u8_t *pOutBuffer, u8_t *pInBuffer, s32_t dest_size, u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t count = 0;
    *src_end_pos = (u32_t)pInBuffer;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while(*pInBuffer != '\0' && dest_size >= (count+4))
    {
        if(*pInBuffer > (char)0x7F)
        {
            pOutBuffer[count++] = (char)0xFF;
            pOutBuffer[count++] = (char)0xFF;
        }
        else
        {
            pOutBuffer[count++] = *pInBuffer;
            pOutBuffer[count++] = '\0';
        }
	 pInBuffer++;
    }
    pOutBuffer[count++] = '\0';
    pOutBuffer[count++] = '\0';
    *src_end_pos = (u32_t)pInBuffer;

    return (u16_t) count;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_utf8
 * DESCRIPTION
 *  
 * PARAMETERS
 *  utf8        [OUT]       
 *  ucs2        [IN]        
 * RETURNS
 *  
 *****************************************************************************/
s32_t mmi_chset_ucs2_to_utf8(u8_t *utf8, u16_t ucs2)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    int count;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if(ucs2 < (u16_t)0x80)
    {
        count = 1;
    }
    else if(ucs2 < (u16_t)0x800)
    {
        count = 2;
    }
    else
    {
        count = 3;
    }
	
    switch(count)
    {
    case 3:
        utf8[2] = 0x80 | (ucs2 & 0x3f);
        ucs2 = ucs2 >> 6;
        ucs2 |= 0x800;
    case 2:
        utf8[1] = 0x80 | (ucs2 & 0x3f);
        ucs2 = ucs2 >> 6;
        ucs2 |= 0xc0;
    case 1:
        utf8[0] = (u8_t)ucs2;
    }
    return count;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_utf8_string_ex
 * DESCRIPTION
 *  
 * PARAMETERS
 *  dest            [OUT]       
 *  dest_size       [IN]        
 *  src             [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
s32_t mmi_chset_ucs2_to_utf8_string_ex(
            u8_t *dest,
            s32_t dest_size,
            u8_t *src,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    int pos = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while(src[0] || src[1])
    {
        if (pos + mmi_chset_ucs2_to_utf8_len(CHR_AT(src, 0)) >= dest_size)      /* leave space of '\0' */
        {
            MMI_CHSET_DBG_ASSERT(0);
            break;
        }

        pos += mmi_chset_ucs2_to_utf8(dest + pos, CHR_AT(src, 0));
        src += 2;
        if (pos >= dest_size - 1)
        {
            break;
        }
    }
    if (pos >= dest_size)
    {
        MMI_CHSET_DBG_ASSERT(0);
        dest[dest_size - 1] = 0;
    }
    else
    {
        dest[pos] = 0;
    }
    *src_end_pos = (u32_t)src;
    return pos + 1;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_utf8_to_ucs2
 * DESCRIPTION
 *  
 * PARAMETERS
 *  dest        [OUT]       
 *  utf8        [IN]        
 * RETURNS
 *  
 *****************************************************************************/
s32_t mmi_chset_utf8_to_ucs2(u8_t *dest, u8_t *utf8)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t c = utf8[0];
    int count = g_cheset_utf8_bytes_per_char[c >> 4];
    u16_t ucs2 = 0xFFFF;   /* invalid character */

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    switch (count)
    {
    case 1:
        ucs2 = (u16_t)c;
        break;
    case 2:
        if (utf8[1])
        {
            ucs2 = ((u16_t) (c & 0x1f) << 6) | (u16_t) (utf8[1] ^ 0x80);
        }
        break;
    case 3:
        if (utf8[1] && utf8[2])
        {
            ucs2 = ((u16_t) (c & 0x0f) << 12)
                | ((u16_t) (utf8[1] ^ 0x80) << 6) | (u16_t) (utf8[2] ^ 0x80);
        }
        break;
    case 4:
        break;
    default:
        count = 1;   /* the character cannot be converted, return 1 means always consume 1 byte */
        break;
    }

    SET_CHR_AT(dest, 0, ucs2);

