duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    return count;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_utf8_to_ucs2_string_ex
 * DESCRIPTION
 *  
 * PARAMETERS
 *  dest            [OUT]       
 *  dest_size       [IN]        
 *  src             [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
s32_t mmi_chset_utf8_to_ucs2_string_ex(
            u8_t *dest,
            s32_t dest_size,
            u8_t *src,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    int pos = 0;
    int cnt;
    int src_len = strlen((const char*)src);

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
#ifdef MMI_CHSET_UTF8_ALLOW_BOM
    if (src_len >= 3 && mmi_chset_is_utf8_BOM(src))
    {
        src += 3;
        src_len -= 3;
    }
#endif /* MMI_CHSET_UTF8_ALLOW_BOM */ 

    MMI_CHSET_DBG_ASSERT((dest_size % 2) == 0);
    dest_size -= (dest_size % 2);
    *src_end_pos = (u32_t)src; /* set src_end_pos first */

    if(dest_size < 2)
    {
        MMI_CHSET_DBG_ASSERT(0);    /* dest wont be NULL-terminated */
        return 0;
    }

    while (*src && pos < dest_size - 2)
    {
        cnt = mmi_chset_utf8_to_ucs2(dest + pos, src);
         
        if(
             (s32_t)(src - (*src_end_pos)) >= (s32_t)(src_len - cnt) &&
             (*(dest + pos) == 0xFF && *(dest + pos + 1) == 0xFF) &&
            !(*src == 0xEF && *(src+1) == 0xBF && *(src+2) == 0xBF)
            )
        {
            /* 
             * If src isn't 0xEF, 0xBF, 0xBF and its remain length is not enough but dest is 0xFFFF, we will abort the process.
             * dest data is invalid character because src data is not enough to convert 
             */
            break;
        }
        if (cnt == 0)   /* abnormal case */
        {
        #ifdef MMI_CHSET_UTF8_FAULT_TOLERANT
            src++;
        #else 
            break;
        #endif 
        }        
        else    /* normal case */
        {
            src += cnt;
            pos += 2;
        }
    }
    *src_end_pos = (u32_t) src;
    dest[pos] = 0;
    dest[pos + 1] = 0;
    return pos + 2;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_utf16_string
 * DESCRIPTION
 *  Converts Unicode text into UTF-16 encoding.
 * PARAMETERS
 *  dest_utf16      [OUT]       Destination buffer. On return, contains the Unicode encoded output string.
 *  dest_size       [IN]        The size of Destination buffer.
 *  utf16_type      [IN]        The type of input UTF-16 encoded string. MMI_CHSET_UTF16LE or MMI_CHSET_UTF16BE
 *  include_bom     [IN]        Should include the byte order mark in the UTF-16 encoded output string.
 *  src_ucs2        [IN]        The UTF-16 encoded input string.
 *  src_end_pos     [OUT]       The point to the end of converted sub-string at the input string.
 * RETURNS
 *  The number of converted bytes, including the final null wide-characters.
 *****************************************************************************/
static s32_t mmi_chset_ucs2_to_utf16_string(
                    u8_t *dest_utf16,
                    s32_t dest_size,
                    ENUM_MMI_CHSET utf16_type,
                    bool include_bom,
                    u8_t *src_ucs2,
                    u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t count = 0;
    u16_t wc;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
	__ASSERT(dest_utf16 && src_ucs2 && src_end_pos, "dest_utf16 && src_ucs2 && src_end_pos");
	__ASSERT((MMI_CHSET_UTF16BE == utf16_type) || (MMI_CHSET_UTF16LE == utf16_type), "(MMI_CHSET_UTF16BE == utf16_type) || (MMI_CHSET_UTF16LE == utf16_type)");

    if (include_bom)
    {
        if (MMI_CHSET_UTF16BE == utf16_type)
        {
            dest_utf16[0] = (u8_t)0xFF;
            dest_utf16[1] = (u8_t)0xFE;
        }
        else
        {
            dest_utf16[0] = (u8_t)0xFE;
            dest_utf16[1] = (u8_t)0xFF;
        }
        dest_utf16 += 2;
        dest_size -= 2;
        count += 2;
    }

    while((src_ucs2[0] || src_ucs2[1]) && (count < (dest_size - 2)))
    {
        wc = MERGE_TO_WCHAR(src_ucs2[1], src_ucs2[0]);

        /* UTF-16 surrogate values are illegal in UCS2; 
           0xffff or 0xfffe are both reserved values */
        if (!(wc >= UTF16_HIGH_START && wc <= UTF16_LOW_END))
        {
            if (MMI_CHSET_UTF16LE == utf16_type)
            {
                dest_utf16[0] = src_ucs2[0];
                dest_utf16[1] = src_ucs2[1];
            }
            else
            {
                dest_utf16[0] = src_ucs2[1];
                dest_utf16[1] = src_ucs2[0];
            }
            dest_utf16 += 2;
            count += 2;
        }
        src_ucs2 += 2;
    }

    dest_utf16[0] = '\0';
    dest_utf16[1] = '\0';

    *src_end_pos = (u32_t) src_ucs2;

    return (count + 2);
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_utf16_to_ucs2_string
 * DESCRIPTION
 *  Converts text encoded using the Unicode transformation format UTF-16
 *  into the Unicode UCS-2 character set.
 * PARAMETERS
 *  dest_ucs2       [OUT]       Destination buffer. On return, contains the Unicode encoded output string.
 *  dest_size       [IN]        The size of Destination buffer.
 *  src_utf16       [IN]        The UTF-16 encoded input string.
 *  utf16_type      [IN]        The type of input UTF-16 encoded string. MMI_CHSET_UTF16LE or MMI_CHSET_UTF16BE
 *  src_end_pos     [OUT]       The point to the end of converted sub-string at the input string.
 * RETURNS
 *  The number of converted bytes, including the final null wide-characters.
 *****************************************************************************/
static s32_t mmi_chset_utf16_to_ucs2_string(
                    u8_t *dest_ucs2,
                    s32_t dest_size,
                    u8_t *src_utf16,
                    ENUM_MMI_CHSET utf16_type,
                    u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s8_t utf16_bo;
    s32_t count = 0;
    u16_t wc1;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
	__ASSERT(dest_ucs2 && src_utf16 && src_end_pos, "dest_ucs2 && src_utf16 && src_end_pos");
	__ASSERT((MMI_CHSET_UTF16BE == utf16_type) || (MMI_CHSET_UTF16LE == utf16_type), "(MMI_CHSET_UTF16BE == utf16_type) || (MMI_CHSET_UTF16LE == utf16_type)");

    utf16_bo = mmi_chset_get_utf_byte_order((s8_t *)src_utf16);

    if (-1 != utf16_bo)
    {
        src_utf16 += 2;
        /* needn't convert the beginning BOM */
    }
    else
    {
        utf16_bo = utf16_type;
    }

    while ((src_utf16[0] || src_utf16[1]) && (count < (dest_size - 2)))
    {
        wc1 = ((MMI_CHSET_UTF16BE == utf16_bo) ?
               MERGE_TO_WCHAR(src_utf16[0], src_utf16[1]) : MERGE_TO_WCHAR(src_utf16[1], src_utf16[0]));

        /* we ignore surrogate pair */
        if (((wc1 >= UTF16_HIGH_START) && (wc1 <= UTF16_HIGH_END)) ||
            ((wc1 >= UTF16_LOW_START) && (wc1 <= UTF16_LOW_END)))
        {
            src_utf16 += 2;
        }
        else
        {
            /* normal case */
            dest_ucs2[0] = wc1 & 0xFF;
            dest_ucs2[1] = wc1 >> 8;
            src_utf16 += 2;
            dest_ucs2 += 2;
            count += 2;
        }
    }

    dest_ucs2[0] = '\0';
    dest_ucs2[1] = '\0';

