duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    *src_end_pos = (u32_t)src_utf16;
	
    return (count + 2);
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_text_to_ucs2_str_ex
 * DESCRIPTION
 *  
 * PARAMETERS
 *  dest            [OUT]       
 *  dest_size       [IN]        
 *  src             [IN]        
 *  encoding        [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
u16_t mmi_chset_text_to_ucs2_str_ex(
            u8_t *dest,
            s32_t dest_size,
            u8_t *src,
            ENUM_ENCODING_TYPE encoding,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    const key_index_t *key_LSB_index_table = g_chset_encode_to_ucs2_key_LSB_index[encoding];
    const u8_t *key_MSB_table = g_chset_encode_to_ucs2_key_MSB[encoding];
#ifdef __MMI_CHSET_GB2312__
    const MSB_Mapping_Struct *gb2312_key_MSB_table = g_chset_gb2312_to_ucs2_key_MSB;
#endif
    const u16_t *ucs2_table = g_chset_encode_to_ucs2_table[encoding];

    u8_t key_LSB;
    u8_t key_MSB;
    s16_t start;
    s16_t end;
    s16_t pos = 0;
    s16_t index;
    u8_t *src_end = src + strlen((char*)src);

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (key_LSB_index_table == NULL || ucs2_table == NULL || (key_MSB_table == NULL
	#ifdef __MMI_CHSET_GB2312__
		 && gb2312_key_MSB_table == NULL
	#endif
		))
    {
        return 0;
    }
    
    while (*(src) != 0) /* I do not know how we assume that this is end of data.. Currently we are taking only chinese encodings for
                           the optimized algo so we can take it as 2 bytes */
    {
        if (*(src) <= 0x7f)
        {
            *(dest + pos) = *src;
            pos++;
            *(dest + pos) = 0;
            pos++;
            src += 1;
        }
        else
        {
			if (src_end - src <= 1)
            {
                /* can't encoding the character. The data may be segmented. */
                break;
            }
            key_LSB = (u8_t)(*(src));
            start = key_LSB_index_table[key_LSB].start;

            if (start < 0)
            {

                dest[pos] = (u8_t)g_chset_unknown_encode_char[encoding];
                dest[pos + 1] = (u8_t)(g_chset_unknown_encode_char[encoding] >> 8);
                src += 1;
            }
            else
            {
                key_MSB = (u8_t) (*(src + 1));
                end = key_LSB_index_table[key_LSB].end;
			#ifdef __MMI_CHSET_GB2312__
                if( GB2312_ENCODING_TYPE == encoding)
                {
                    index = mmi_chset_binary_search_MSB_mapping_table(key_MSB, gb2312_key_MSB_table, mmi_chset_gb2312_to_ucs2_MSB_size(), start, end);
                }
                else
			#endif
                {
                    index = mmi_chset_binary_search(key_MSB, key_MSB_table, start, end);
                }

                if (index < 0)  /* key MSB not found */
                {
                    dest[pos] = (u8_t) g_chset_unknown_encode_char[encoding];
                    dest[pos + 1] = (u8_t) (g_chset_unknown_encode_char[encoding] >> 8);
                }
                else
                {
                    dest[pos] = (u8_t) ucs2_table[index];
                    dest[pos + 1] = (u8_t) (ucs2_table[index] >> 8);
                }
                src += 2;
            }
            pos += 2;
        }
        if (pos >= dest_size - 2)
        {
            break;
        }
    }
    *src_end_pos = (u32_t) src;
    dest[pos] = 0;
    dest[pos + 1] = 0;
    return pos + 2;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_text_str_ex
 * DESCRIPTION
 *  
 * PARAMETERS
 *  dest            [OUT]       
 *  dest_size       [IN]        
 *  src             [IN]        
 *  encoding        [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
u16_t mmi_chset_ucs2_to_text_str_ex(
            u8_t *dest,
            s32_t dest_size,
            u8_t *src,
            ENUM_ENCODING_TYPE encoding,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    const key_index_t *key_LSB_index_table = g_chset_ucs2_to_encode_key_LSB_index[encoding];
    const u8_t *key_MSB_table = g_chset_ucs2_to_encode_key_MSB[encoding];
    const u16_t *encode_table = g_chset_ucs2_to_encode_table[encoding];
    u8_t key_LSB;
    u8_t key_MSB;
    s16_t start;
    s16_t end;
    s16_t index;
    s16_t pos = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (key_LSB_index_table == NULL || key_MSB_table == NULL || encode_table == NULL)
    {
        return 0;
    }
    
    while (*src || *(src + 1))
    {
        if (*src <= 0x7f && *(src + 1) == 0)
        {
            *(dest + pos) = *(src);
            pos++;
        }
        else
        {
            /*
             * The original conversion tables of mmi_chset_ucs2_to_text_str() seem to assume the src is big-endian,
             * but the src should be little-endian. We need to change the byte order.
             */
            key_LSB = (u8_t) (*(src + 1));
            start = key_LSB_index_table[key_LSB].start;
            if (start < 0)
            {
                dest[pos] = (u8_t) (g_chset_unknown_encode_char[encoding] >> 8);
                dest[pos + 1] = (u8_t) g_chset_unknown_encode_char[encoding];
            }
            else
            {
                key_MSB = (u8_t) (*(src));
                end = key_LSB_index_table[key_LSB].end;
                if ((index = mmi_chset_binary_search(key_MSB, key_MSB_table, start, end)) < 0)  /* key MSB not found */
                {
                    dest[pos] = (u8_t) (g_chset_unknown_encode_char[encoding] >> 8);
                    dest[pos + 1] = (u8_t) g_chset_unknown_encode_char[encoding];
                }
                else
                {
                    dest[pos] = (u8_t) (encode_table[index] >> 8);
                    dest[pos + 1] = (u8_t) encode_table[index];
                }
            }
            pos += 2;
        }
        src += 2;

        if (pos >= dest_size - 1)
        {
            break;
        }
    }
    *src_end_pos = (u32_t) src;
    dest[pos] = 0;
    return pos + 1;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_encode_decode_algo2
 * DESCRIPTION
 *  
 * PARAMETERS
 *  Scheme          [IN]        
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 *  nBuffsize       [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static u16_t mmi_chset_encode_decode_algo2(
                    ENUM_MMI_CHSET_PAIR Scheme,
                    u8_t *pOutBuffer,
                    u8_t *pInBuffer,
                    s32_t nBuffsize,
                    u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    switch (Scheme)
    {
    #ifdef __MMI_CHSET_GB2312__
        case GB2312_TO_UCS2:
            return mmi_chset_text_to_ucs2_str_ex(
                    (u8_t*) pOutBuffer,
                    nBuffsize,
                    (u8_t*) pInBuffer,
                    GB2312_ENCODING_TYPE,
                    src_end_pos);
        case UCS2_TO_GB2312:
            return mmi_chset_ucs2_to_text_str_ex(
                    (u8_t*) pOutBuffer,
                    nBuffsize,
                    (u8_t*) pInBuffer,
                    GB2312_ENCODING_TYPE,
                    src_end_pos);
	#endif
	#ifdef __MMI_CHSET_BIG5__
        case BIG5_TO_UCS2:
            return mmi_chset_text_to_ucs2_str_ex(
                    (u8_t*) pOutBuffer,
                    nBuffsize,
                    (u8_t*) pInBuffer,
                    BIG_5_ENCODING_TYPE,
                    src_end_pos);
        case UCS2_TO_BIG5:
            return mmi_chset_ucs2_to_text_str_ex(
                    (u8_t*) pOutBuffer,
                    nBuffsize,
                    (u8_t*) pInBuffer,
                    BIG_5_ENCODING_TYPE,
                    src_end_pos);
	#endif
	#ifdef __MMI_CHSET_HKSCS__
        case HKSCS_TO_UCS2:
            return mmi_chset_text_to_ucs2_str_ex(
                    (u8_t*) pOutBuffer,
                    nBuffsize,
                    (u8_t*) pInBuffer,
                    HKSCS_ENCODING_TYPE,
                    src_end_pos);
        case UCS2_TO_HKSCS:
            return mmi_chset_ucs2_to_text_str_ex(
                    (u8_t*) pOutBuffer,
                    nBuffsize,
                    (u8_t*) pInBuffer,
                    HKSCS_ENCODING_TYPE,
                    src_end_pos);
	#endif
        default:
            return 0;
    }
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_utf7_str
 * DESCRIPTION
 *  Encodes the MMI UCS Buffer to UTF7 Buffer for sending a mail
 * PARAMETERS
 *  g_encoded_buf       [OUT]       Encoded Data
 *  g_data_buf          [IN]        MMI Editor Data
 *  data_size           [IN]        
 * RETURNS
 *  Nothing
 *****************************************************************************/
int mmi_chset_ucs2_to_utf7_str(u8_t *g_encoded_buf, u8_t *g_data_buf, int data_size, u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t temp_char[3];
    unsigned short *current_char, prev_char = 0;
    int output_len = 0, ucs2_chars_count = 0, ctr = 0, encode_flag = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    data_size -= 2;
    prev_char = 0;

