duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    while(!(g_data_buf[ctr] == NULL && g_data_buf[ctr + 1] == NULL))   /* ctr < len * 2 ) */
    {
        temp_char[0] = g_data_buf[ctr];
        temp_char[1] = g_data_buf[ctr + 1];
        temp_char[2] = 0;

        current_char = (unsigned short*)temp_char;

        if(temp_char[0] == '+')
        {
            if(encode_flag == 1)
            {
                encode_flag = 0;
                if(ucs2_chars_count)
                {
                    mmi_ucs2_utf_chars(
                        g_encoded_buf,
                        &output_len,
                        *current_char,
                        prev_char,
                        ucs2_chars_count,
                        encode_flag,
                        data_size);
                }
                g_encoded_buf[output_len++] = '-';
            }

            if (output_len < data_size - 1)
            {
                g_encoded_buf[output_len++] = '+';
                g_encoded_buf[output_len++] = '-';
            }
            else
            {
                break;
            }
            ucs2_chars_count = 0;
        }
        else if(direct_chars_ucs2_to_utf(*current_char))
        {
            /*
             * If Unicode value is less than 0x7F, 
             * leaving "Modified Base 64" encoding and encode char directly.
             */
            if (encode_flag == 1)
            {
                encode_flag = 0;
                if (ucs2_chars_count)
                {
                    mmi_ucs2_utf_chars(
                        g_encoded_buf,
                        &output_len,
                        *current_char,
                        prev_char,
                        ucs2_chars_count,
                        encode_flag,
                        data_size);
                }
                g_encoded_buf[output_len++] = '-';
            }
            if (output_len < data_size)
            {
                g_encoded_buf[output_len++] = (u8_t)(*current_char);
            }
            else
            {
                break;
            }

            ucs2_chars_count = 0;
        }
        else
        {
            /*
             * If Unicode value is larger than 0x7F, 
             * entering "Modified Base 64" encoding.
             */
            if (encode_flag == 0)
            {
                g_encoded_buf[output_len++] = '+';
                encode_flag = 1;
            }

            /*
             * Encode UTF7 chars from Unicode
             * Every Unicode is 16 bits (2 bytes)
             * Every UTF7 char would be transfered from 6 bits according "Modified Base 64"
             * One Unicode will encode three UTF7 chars in worst case (padding bits in 0).
             * There are three cases:
             * Case 1: (No previous Unicode)
             *     1 Unicode encodes 2 UTF7 chars, and remains 4 bits
             *     - ucs2_chars_count: 0
             * Case 2: (Previous Unicode remains 4 bits)
             *     Previous Unicode(4 bits) and 1 Unicode encode 3 UTF7 chars, and remain 2 bits
             *     - ucs2_chars_count: 1
             * Case 3: (Previous Unicode remains 2 bits)
             *     Previous Unicode(2 bits) and 1 Unicode encode 3 UTF7 chars, and no remained bits
             *     - ucs2_chars_count: 2
             */
            mmi_ucs2_utf_chars(
                g_encoded_buf,
                &output_len,
                *current_char,
                prev_char,
                ucs2_chars_count,
                encode_flag,
                data_size);
            ucs2_chars_count++;
            if (ucs2_chars_count == 3)
            {
                ucs2_chars_count = 0;
            }
        }
        ctr += 2;
        prev_char = *current_char;
    }

    *src_end_pos = (u32_t)(&g_data_buf[ctr]);

    g_encoded_buf[output_len] = 0;
    return output_len + 1;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_utf7_to_ucs2_str
 * DESCRIPTION
 *  decodes UTF7 Buffer to MMI UCS Buffer for after recieving a mail.
 *  refer RFC 2152 to get UTF7 format
 * PARAMETERS
 *  g_unicode_decoded_buf       [OUT]       Decoded Data
 *  g_encoded_buf               [IN]        This is UTF7 encoded buffer to be converted
 *  data_size                   [IN]        Size of destination buffer (bytes)
 * RETURNS
 *  length of decoded buffer
 *****************************************************************************/
int mmi_chset_utf7_to_ucs2_str(u8_t *g_unicode_decoded_buf, u8_t *g_encoded_buf, int data_size, u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    int ctr = 0, output_len = 0, temp_ctr = 0, no_decoded_combinations = 0;
    u8_t current_encoded_buf[3] = {0}, prev_last_char = 0, ch;
    int g_plus_indicator_flag = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while(g_encoded_buf[ctr] != 0 && output_len < data_size - 2)
    {
        ch = g_encoded_buf[ctr];
        /*
         * When the char is '+', begin to decode UTF7 according "Modified Base 64" (REC 2045).
         * When the char is '-', end of decoding UTF7 according "Modified Base 64".
         */
        if ((ch != '+') && (g_plus_indicator_flag == 0))
        {
            /* the octet value should be less than 0x7F */
            g_unicode_decoded_buf[output_len++] = ch;
            g_unicode_decoded_buf[output_len++] = 0;
        }
        else
        {
            char temp_buff = 0; /* For taking care for the unicode + character */

            if ((ch != '-') && (g_plus_indicator_flag == 1))
            {
                current_encoded_buf[temp_ctr++] = ch;
            }

            if ((temp_ctr == 3 && no_decoded_combinations != 2) || (temp_ctr == 2 && no_decoded_combinations == 2))
            {
                /*
                 * Every UTF7 char would be transfered to 6 bits according "Modified Base 64"
                 * Every Unicode is 16 bits (2 bytes)
                 * Three UTF7 chars will encode one Unicode in worst case.
                 * There are three cases:
                 * Case 1: (No previous char)
                 *     Need 3 UTF7 chars encode 1 Unicode, and remain 2 bits
                 *     - no_decoded_combinations: 0
                 * Case 2: (Previous char remains 2 bits, and still need 3 UTF7 chars)
                 *     Need more 3 UTF7 chars to encode 1 Unicode, and remain 4 bits
                 *     - no_decoded_combinations: 1
                 * Case 3: (Previous char remains 4 bits, and only need 2 UTF7 chars)
                 *     Need more 2 UTF7 chars to encode 1 Unicode. (no remained bits)
                 *     - no_decoded_combinations: 2
                 */
                mmi_utf_ucs2_chars(
                    g_unicode_decoded_buf,
                    current_encoded_buf,
                    prev_last_char,
                    no_decoded_combinations,
                    &output_len);
                no_decoded_combinations++;
                prev_last_char = (no_decoded_combinations) ? current_encoded_buf[2] : NULL;
                if (no_decoded_combinations == 3)
                {
                    no_decoded_combinations = 0;
                }
                current_encoded_buf[0] = 0;
                current_encoded_buf[1] = 0;
                current_encoded_buf[2] = 0;
                temp_ctr = 0;
            }

            g_plus_indicator_flag = 1;

            if ((ch == '-') && (temp_ctr != 0))
            {
                mmi_utf_ucs2_chars(
                    g_unicode_decoded_buf,
                    current_encoded_buf,
                    prev_last_char,
                    no_decoded_combinations % 3,
                    &output_len);
                /* handle this condition in decoder where chars less then 3 */
                current_encoded_buf[0] = 0;
                current_encoded_buf[1] = 0;
                current_encoded_buf[2] = 0;

                prev_last_char = 0;
                no_decoded_combinations = 0;
                g_plus_indicator_flag = 0;
                temp_ctr = 0;
            }
            else if ((ch == '-') && (temp_ctr == 0))
            {
                current_encoded_buf[0] = 0;
                current_encoded_buf[1] = 0;
                current_encoded_buf[2] = 0;

                prev_last_char = 0;
                no_decoded_combinations = 0;
                g_plus_indicator_flag = 0;
                temp_ctr = 0;
            }
            temp_buff = g_encoded_buf[ctr + 1];
            if (ch == '+' && temp_buff == '-')  /* Fot taking care for the unicode '+' character */
            {
                g_unicode_decoded_buf[output_len++] = ch;
                g_unicode_decoded_buf[output_len++] = 0;
            }
        }
        ctr++;
    }

    *src_end_pos = (u32_t)(&g_encoded_buf[ctr]);

