duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    g_unicode_decoded_buf[output_len] = 0;
    g_unicode_decoded_buf[output_len + 1] = 0;
    return (2 * (output_len + 1));

}

#ifdef __MMI_CHSET_GB18030__
/*****************************************************************************
 * FUNCTION
 *  mmi_chset_gb18030_to_ucs2_2_byte_search
 * DESCRIPTION
 *  
 * PARAMETERS
 *  src         [IN]        
 *  dest        [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static bool mmi_chset_gb18030_to_ucs2_2_byte_search(u16_t src, u16_t *dest)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t start, end, mid;
    u16_t result;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    start = 0;
    end = mmi_chset_gb18030_ucs2_2byte_size() - 1;
    while (start <= end)
    {
        if ((end - start) == 1) /* to prevent missed-comaprison */
        {
            mid = end;
        }
        else
        {
            mid = (start + end) / 2;
        }
        result = g_chset_gb18030_to_ucs2_2_byte_tbl[mid].gb_code;
        if (src > result)
        {
            start = mid + 1;
        }
        else if (src < result)
        {
            end = mid - 1;
        }
        else    /* found */
        {
            *dest = g_chset_gb18030_to_ucs2_2_byte_tbl[mid].ucs2_code;
            return true;
        }
    }

    return false;
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_gb18030_to_ucs2_4_byte_search
 * DESCRIPTION
 *  
 * PARAMETERS
 *  src         [IN]        
 *  dest        [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static bool mmi_chset_gb18030_to_ucs2_4_byte_search(u32_t src, u16_t *dest)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t start, end, mid;
    u32_t result;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    start = 0;
    end = mmi_chset_gb18030_ucs2_4byte_size() - 1;
    while (start <= end)
    {
        if ((end - start) == 1) /* to prevent missed-comaprison */
        {
            mid = end;
        }
        else
        {
            mid = (start + end) / 2;
        }
        result =
            (u32_t)((g_chset_gb18030_to_ucs2_4_byte_tbl[mid].gb_code_high << 16) +
                          (g_chset_gb18030_to_ucs2_4_byte_tbl[mid].gb_code_low));
        if (src > result)
        {
            start = mid + 1;
        }
        else if (src < result)
        {
            end = mid - 1;
        }
        else    /* found */
        {
            *dest = g_chset_gb18030_to_ucs2_4_byte_tbl[mid].ucs2_code;
            return true;
        }
    }

    return false;
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_gb18030_to_ucs2
 * DESCRIPTION
 *  
 * PARAMETERS
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 *  inLen           [IN]        
 * RETURNS
 *  
 *****************************************************************************/
u16_t mmi_chset_gb18030_to_ucs2(u8_t *pOutBuffer, u8_t *pInBuffer, s32_t inLen)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t c1, c2, c3, c4;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    /* pre-insert unknown character */
    pOutBuffer[0] = 0xff;
    pOutBuffer[1] = 0xff;

    c1 = pInBuffer[0];
    if (c1 < 0x80)  /* 1 byte */
    {
        pOutBuffer[0] = pInBuffer[0];
        pOutBuffer[1] = 0x00;
        return 1;   /* consume 1 byte */
    }

    if (inLen >= 2)
    {
        c2 = pInBuffer[1];
    }
    else
    {
        return 1;   /* consume 1 byte */
    }

    /* 2 bytes */
    if ((c1 >= 0x81 && c1 <= 0xfe) && ((c2 >= 0x40 && c2 <= 0x7e) || (c2 >= 0x80 && c2 <= 0xfe)))
    {
        u16_t src, dest;

        src = (((c1 << 8) & 0xff00) + c2);

        /* binary search 2 bytes table */
        if (mmi_chset_gb18030_to_ucs2_2_byte_search(src, &dest))
        {
            pOutBuffer[0] = (u8_t)(dest & 0xff);
            pOutBuffer[1] = (u8_t)(dest >> 8);
            return 2;
        }
        else
        {
            return 1;   /* consume 1 byte */
        }
    }

    if (inLen >= 4) /* 4 bytes */
    {
        c3 = pInBuffer[2];
        c4 = pInBuffer[3];

        if (c1 >= 0x81 && c2 <= 0xfe)
            if (c2 >= 0x30 && c2 <= 0x39)
                if (c3 >= 0x81 && c3 <= 0xfe)
                    if (c4 >= 0x30 && c4 <= 0x39)
                    {
                        u32_t src;
                        u16_t dest;

                        /* binary search 4 bytes table */
                        src = (u32_t) ((c1 << 24) + (c2 << 16) + (c3 << 8) + c4);

                        if (mmi_chset_gb18030_to_ucs2_4_byte_search(src, &dest))
                        {
                            pOutBuffer[0] = (u8_t)(dest & 0xff);
                            pOutBuffer[1] = (u8_t)(dest >> 8);
                            return 4;
                        }
                        else
                        {
                            return 1;   /* consume 1 byte */
                        }
                    }
    }

    return 1;
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_gb18030_to_ucs2_str
 * DESCRIPTION
 *  
 * PARAMETERS
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 *  dest_size       [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static u16_t mmi_chset_gb18030_to_ucs2_str(
                    u8_t *pOutBuffer,
                    u8_t *pInBuffer,
                    s32_t dest_size,
                    u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t *in_cursor = pInBuffer;
    u8_t *out_cursor = pOutBuffer;
    u8_t tmp_result[2];

