duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    u16_t diget_len;
    s32_t in_len = strlen((char*)pInBuffer);
    s32_t out_len = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while (in_len && dest_size > (out_len + 2))
    {
        diget_len = mmi_chset_gb18030_to_ucs2((u8_t*)&tmp_result, (u8_t*)in_cursor, in_len);
        if (tmp_result[0] == 0xFF && tmp_result[1] == 0xFF && in_len == diget_len)
        {
            /* the last remained data of pInBuffer may be segmented */
            break;
        }
        in_len -= diget_len;
        in_cursor += diget_len;

        out_cursor[0] = tmp_result[0];
        out_cursor[1] = tmp_result[1];
        out_cursor += 2;
        out_len += 2;
    }
    *src_end_pos = (u32_t) in_cursor;

    pOutBuffer[out_len] = 0;
    pOutBuffer[++out_len] = 0;
    return (out_len + 1);
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_gb18030_to_ucs2_str_with_src_length
 * DESCRIPTION
 *  
 * PARAMETERS
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 *  dest_size       [IN]        
 *  in_len          [IN]        
 * RETURNS
 *  
 *****************************************************************************/
static u16_t mmi_chset_gb18030_to_ucs2_str_with_src_length(
                    u8_t *pOutBuffer,
                    u8_t *pInBuffer,
                    s32_t dest_size,
                    s32_t in_len)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t *in_cursor = pInBuffer;
    u8_t *out_cursor = pOutBuffer;
    u8_t tmp_result[2];

    u16_t diget_len;
    s32_t out_len = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while (in_len && dest_size > (out_len + 2))
    {
        diget_len = mmi_chset_gb18030_to_ucs2((u8_t*)&tmp_result, (u8_t*)in_cursor, in_len);
        in_len -= diget_len;
        in_cursor += diget_len;

        out_cursor[0] = tmp_result[0];
        out_cursor[1] = tmp_result[1];
        out_cursor += 2;
        out_len += 2;
    }

    return (out_len);
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_gb18030_2_byte_search
 * DESCRIPTION
 *  
 * PARAMETERS
 *  src         [IN]        
 *  dest        [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static bool mmi_chset_ucs2_to_gb18030_2_byte_search(u16_t src, u32_t *dest)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t start, end, mid;
    u16_t result;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    start = 0;
    end = mmi_chset_ucs2_gb18030_2byte_size() - 1;
    while (start <= end)
    {
        if ((end - start) == 1) /* to prevent missed-comaprison */
        {
            mid = end;
        }
        else
        {
            mid = (start + end) / 2;
        }
        result = g_chset_ucs2_to_gb18030_2_byte_tbl[mid].ucs2_code;
        if (src > result)
        {
            start = mid + 1;
        }
        else if (src < result)
        {
            end = mid - 1;
        }
        else    /* found */
        {
            *dest = g_chset_ucs2_to_gb18030_2_byte_tbl[mid].gb_code;
            return true;
        }
    }

    return false;

}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_gb18030_4_byte_search
 * DESCRIPTION
 *  
 * PARAMETERS
 *  src         [IN]        
 *  dest        [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static bool mmi_chset_ucs2_to_gb18030_4_byte_search(u16_t src, u32_t *dest)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t start, end, mid;
    u16_t result;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    start = 0;
    end = mmi_chset_gb18030_ucs2_4byte_size() - 1;
    while (start <= end)
    {
        if ((end - start) == 1) /* to prevent missed-comaprison */
        {
            mid = end;
        }
        else
        {
            mid = (start + end) / 2;
        }
        result = g_chset_gb18030_to_ucs2_4_byte_tbl[mid].ucs2_code;
        if (src > result)
        {
            start = mid + 1;
        }
        else if (src < result)
        {
            end = mid - 1;
        }
        else    /* found */
        {
            *dest =
                (u32_t)((g_chset_gb18030_to_ucs2_4_byte_tbl[mid].gb_code_high << 16) +
                              g_chset_gb18030_to_ucs2_4_byte_tbl[mid].gb_code_low);
            return true;
        }
    }

    return false;
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_gb18030
 * DESCRIPTION
 *  
 * PARAMETERS
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 * RETURNS
 *  
 *****************************************************************************/
u16_t mmi_chset_ucs2_to_gb18030(u8_t *pOutBuffer, u8_t *pInBuffer)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u16_t ucs2_char;
    u32_t gb_char;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    /* single byte */
    if (pInBuffer[1] == 0 && pInBuffer[0] < 0x80)
    {
        pOutBuffer[0] = pInBuffer[0];
        return 1;
    }

    ucs2_char = ((pInBuffer[1] << 8) + pInBuffer[0]);
    /* search 2 bytes table */
    if (mmi_chset_ucs2_to_gb18030_2_byte_search(ucs2_char, &gb_char))
    {
        pOutBuffer[0] = (u8_t)((gb_char >> 8) & 0xff);
        pOutBuffer[1] = (u8_t)(gb_char & 0xff);
        return 2;
    }

    /* search 4 bytes table */
    if (mmi_chset_ucs2_to_gb18030_4_byte_search(ucs2_char, &gb_char))
    {
        pOutBuffer[0] = (u8_t)((gb_char >> 24) & 0xff);
        pOutBuffer[1] = (u8_t)((gb_char >> 16) & 0xff);
        pOutBuffer[2] = (u8_t)((gb_char >> 8) & 0xff);
        pOutBuffer[3] = (u8_t)(gb_char & 0xff);
        return 4;
    }

    /* unknown character */
    pOutBuffer[0] = 0xff;
    return 1;
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_gb18030_str
 * DESCRIPTION
 *  
 * PARAMETERS
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 *  dest_size       [IN]        
 *  src_end_pos     [OUT]       
 * RETURNS
 *  
 *****************************************************************************/
static u16_t mmi_chset_ucs2_to_gb18030_str(
                    u8_t *pOutBuffer,
                    u8_t *pInBuffer,
                    s32_t dest_size,
                    u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t *in_cursor = pInBuffer;
    u8_t *out_cursor = pOutBuffer;
    u8_t tmp_result[4];

    s32_t out_len = 0;
    s32_t i;
    u16_t result_len;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while ((in_cursor[0] != 0) || (in_cursor[1] != 0) && (dest_size > (out_len + 2)))
    {
        result_len = mmi_chset_ucs2_to_gb18030((unsigned char*)&tmp_result, (unsigned char*)in_cursor);

