duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
        for (i = (result_len - 1); i >= 0; i--)
        {
            out_cursor[i] = tmp_result[i];
        }

        in_cursor += 2;
        out_cursor += result_len;
        out_len += result_len;
    }
    *src_end_pos = (u32_t) in_cursor;

    pOutBuffer[out_len] = 0;
    pOutBuffer[++out_len] = 0;
    return (out_len + 1);
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_gb18030_str_with_src_length
 * DESCRIPTION
 *  
 * PARAMETERS
 *  pOutBuffer      [OUT]       
 *  pInBuffer       [IN]        
 *  dest_size       [IN]        
 *  src_size        [IN]        
 * RETURNS
 *  
 *****************************************************************************/
static u16_t mmi_chset_ucs2_to_gb18030_str_with_src_length(
                    u8_t *pOutBuffer,
                    u8_t *pInBuffer,
                    s32_t dest_size,
                    s32_t src_size)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u8_t *in_cursor = pInBuffer;
    u8_t *out_cursor = pOutBuffer;
    u8_t tmp_result[4];

    s32_t out_len = 0;
    s32_t i;
    u16_t result_len;
    s32_t src_index = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    while (src_index < src_size && (dest_size > (out_len + 2)))
    {
        result_len = mmi_chset_ucs2_to_gb18030((unsigned char*)&tmp_result, (unsigned char*)in_cursor);

        for (i = (result_len - 1); i >= 0; i--)
        {
            out_cursor[i] = tmp_result[i];
        }

        in_cursor += 2;
        out_cursor += result_len;
        out_len += result_len;
        src_index += 2;
    }

    return (out_len);
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_convert_with_src_length
 * DESCRIPTION
 *  
 * PARAMETERS
 *  src_type        [IN]        
 *  dest_type       [IN]        
 *  src_buff        [IN]        
 *  src_size        [IN]        
 *  dest_buff       [OUT]       
 *  dest_size       [IN]        
 * RETURNS
 *  
 *****************************************************************************/
s32_t mmi_chset_convert_with_src_length(
            ENUM_MMI_CHSET src_type,
            ENUM_MMI_CHSET dest_type,
            char *src_buff,
            s32_t src_size,
            char *dest_buff,
            s32_t dest_size)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (src_type == MMI_CHSET_GB18030 && dest_type == MMI_CHSET_UCS2)
    {
        return mmi_chset_gb18030_to_ucs2_str_with_src_length((u8_t*)dest_buff, (u8_t*)src_buff, dest_size, src_size);
    }
    else if (src_type == MMI_CHSET_UCS2 && dest_type == MMI_CHSET_GB18030)
    {
        return mmi_chset_ucs2_to_gb18030_str_with_src_length((u8_t*)dest_buff, (u8_t*)src_buff, dest_size, src_size);
    }
    /* only support GB18030 for now */
    return 0;

}
#endif /* __MMI_CHSET_GB18030__ */ 


#ifdef __MMI_CHSET_SJIS__
/*****************************************************************************
 * FUNCTION
 *  mmi_chset_sjis_to_ucs2
 * DESCRIPTION
 *  Convert the Shift JIS string to UCS2
 * PARAMETERS
 *  dest            [OUT]       dest buffer
 *  dest_size       [IN]        dest buffer size
 *  src             [IN]        source buffer
 *  src_end_pos     [OUT]       source buffer end position
 * RETURNS
 *  Converted byte number
 *****************************************************************************/
u32_t mmi_chset_sjis_to_ucs2(
            u8_t *dest,
            s32_t dest_size,
            u8_t *src,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    const key_index_t *key_LSB_index_table = g_chset_sjis_to_ucs2_key_LSB_index;
    const u8_t *key_MSB_table = g_chset_sjis_to_ucs2_key_MSB;
    const u16_t *ucs2_table = g_chset_sjis_to_ucs2_table;

    u8_t key_LSB;
    u8_t key_MSB;
    s16_t start;
    s16_t end;
    u32_t pos = 0;
    s16_t index;
    u8_t *src_end = src + strlen((char*)src);

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (key_LSB_index_table == NULL || key_MSB_table == NULL || ucs2_table == NULL)
    {
        return 0;
    }

    while (*(src) != 0)
    {
        if (*(src) <= 0x7f)
        {
            *(dest + pos) = *src;
            pos++;
            *(dest + pos) = 0;
            pos++;
            src += 1;
        }
        else if ((*(src) >= 0xA1) && (*(src) <= 0xDF))
        {
            *(dest + pos) = 0x61 + (*(src) - 0xA1);
            pos++;
            *(dest + pos) = 0xFF;
            pos++;
            src += 1;
        }
        else
        {
            key_LSB = (u8_t)(*(src + 1));
            start = key_LSB_index_table[key_LSB].start;

            if (start < 0)
            {
                if (src_end - src <= 1)
                {
                    /* can't encoding the character. The data may be segmented. */
                    break;
                }
                else
                {
                    dest[pos] = (u8_t)0xFF;
                    dest[pos + 1] = (u8_t)0xFF;
                }
            }
            else
            {
                key_MSB = (u8_t) (*(src));
                end = key_LSB_index_table[key_LSB].end;
                if ((index = mmi_chset_binary_search(key_MSB, key_MSB_table, start, end)) < 0)  /* key MSB not found */
                {
                    if (src_end - src <= 1)
                    {
                        /* can't encoding the character. The data may be segmented. */
                        break;
                    }
                    else
                    {
                        dest[pos] = (u8_t)0xFF;
                        dest[pos + 1] = (u8_t)0xFF;
                    }
                }
                else
                {
                    dest[pos] = (u8_t) ucs2_table[index];
                    dest[pos + 1] = (u8_t) (ucs2_table[index] >> 8);

