duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
                }
            }
            src += 2;
            pos += 2;
        }
        if (pos >= dest_size - 2)
        {
            break;
        }
    }
    *src_end_pos = (u32_t)src;
    dest[pos] = 0;
    dest[pos + 1] = 0;
    return pos + 2;
}


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_ucs2_to_sjis
 * DESCRIPTION
 *  Convert the UCS2 string to Shift JIS
 * PARAMETERS
 *  dest            [OUT]       dest buffer
 *  dest_size       [IN]        dest buffer size
 *  src             [IN]        source buffer
 *  src_end_pos     [OUT]       source buffer end position
 * RETURNS
 *  Converted byte number
 *****************************************************************************/
u32_t mmi_chset_ucs2_to_sjis(
            u8_t *dest,
            s32_t dest_size,
            u8_t *src,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    const key_index_t *key_LSB_index_table = g_chset_ucs2_to_sjis_key_LSB_index;
    const u8_t *key_MSB_table = g_chset_ucs2_to_sjis_key_MSB;
    const u16_t *encode_table = g_chset_ucs2_to_sjis_table;
    u8_t key_LSB;
    u8_t key_MSB;
    s16_t start;
    s16_t end;
    s16_t index;
    u32_t pos = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    if (key_LSB_index_table == NULL || key_MSB_table == NULL || encode_table == NULL)
    {
        return 0;
    }

    while (*src || *(src + 1))
    {
        if (*src <= 0x7f && *(src + 1) == 0)
        {
            *(dest + pos) = *(src);
            pos++;
        }
        else if ((*(src + 1) == 0xFF) && ((*src >= 0x61) && (*src <= 0x9F)))
        {
            *(dest + pos) = 0xA1 + (*(src) - 0x61);
            pos++;
        }
        else
        {
            key_LSB = (u8_t)(*(src));
            start = key_LSB_index_table[key_LSB].start;
            if (start < 0)
            {
                dest[pos] = (u8_t)0xFF;
                dest[pos + 1] = (u8_t)0xFF;
            }
            else
            {
                key_MSB = (u8_t)(*(src + 1));
                end = key_LSB_index_table[key_LSB].end;
                if ((index = mmi_chset_binary_search(key_MSB, key_MSB_table, start, end)) < 0)  /* key MSB not found */
                {
                    dest[pos] = (u8_t)0xFF;
                    dest[pos + 1] = (u8_t)0xFF;
                }
                else
                {
                    dest[pos] = (u8_t) (encode_table[index] >> 8);
                    dest[pos + 1] = (u8_t) encode_table[index];
                }

            }
            pos += 2;
        }
        src += 2;

        if (pos >= dest_size - 2)
        {
            break;
        }
    }
    *src_end_pos = (u32_t)src;
    dest[pos] = 0;
    dest[pos + 1] = 0;
    return pos + 2;
}
#endif /* __MMI_CHSET_SJIS__ */


/*****************************************************************************
 * FUNCTION
 *  mmi_chset_convert_to_native_ucs2
 * DESCRIPTION
 *  Convert string to given character set from native (LE) UCS2 . (will add the terminate character)
 * PARAMETERS
 *  dest_type       [IN]        Charset type of destination
 *  src_buff        [IN]        Buffer stores source string
 *  dest_buff       [OUT]       Buffer stores destination string
 *  dest_size       [IN]        Size of destination buffer (bytes)
 *  src_end_pos     [OUT]       
 * RETURNS
 *  Length of destination string, including null terminator. (bytes)
 *****************************************************************************/
static s32_t mmi_chset_convert_from_native_ucs2(
            ENUM_MMI_CHSET dest_type,
            u8_t *src_buff,
            u8_t *dest_buff,
            s32_t dest_size,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t result = 0;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    switch(dest_type)
    {
    case MMI_CHSET_ASCII:            
        result = mmi_chset_ucs2_to_ascii(dest_buff, src_buff, dest_size, src_end_pos);                          
        break;
    case MMI_CHSET_UTF8: 
        result = mmi_chset_ucs2_to_utf8_string_ex(
            (u8_t*) dest_buff,
            dest_size,
            (u8_t*) src_buff,
            src_end_pos);
        break;	
    case MMI_CHSET_UTF16LE:
        result = mmi_chset_ucs2_to_utf16_string(
            dest_buff,
            dest_size,
            MMI_CHSET_UTF16LE,
            false,
            src_buff,
            src_end_pos);
        break;
    case MMI_CHSET_UTF16BE:
        result = mmi_chset_ucs2_to_utf16_string(
            dest_buff,
            dest_size,
            MMI_CHSET_UTF16BE,
            false,
            src_buff,
            src_end_pos);
        break;       

#ifdef __MMI_CHSET_BIG5__ 
    case MMI_CHSET_BIG5:
        result = mmi_chset_encode_decode_algo2(UCS2_TO_BIG5, dest_buff, src_buff, dest_size, src_end_pos);    /* Length is hardcode for now to maximum */
        break;
#endif

#ifdef __MMI_CHSET_GB2312__
    case MMI_CHSET_GB2312:            
        result = mmi_chset_encode_decode_algo2(UCS2_TO_GB2312, dest_buff, src_buff, dest_size, src_end_pos);    /* Length is hardcode for now to maximum */
        break;
#endif

#ifdef __MMI_CHSET_HKSCS__
    case MMI_CHSET_HKSCS:            
        result = mmi_chset_encode_decode_algo2(UCS2_TO_HKSCS, dest_buff, src_buff, dest_size, src_end_pos);    /* Length is hardcode for now to maximum */
        break;
#endif

#ifdef __MMI_CHSET_UTF7__
    case MMI_CHSET_UTF7:
        result = mmi_chset_ucs2_to_utf7_str(dest_buff, src_buff, dest_size, src_end_pos);
        break;       
#endif

#ifdef __MMI_CHSET_GB18030__
    case MMI_CHSET_GB18030:
        result = mmi_chset_ucs2_to_gb18030_str(dest_buff, src_buff, dest_size, src_end_pos);           
        break;          
#endif

#ifdef __MMI_CHSET_SJIS__
    case MMI_CHSET_SJIS:
        result = mmi_chset_ucs2_to_sjis((u8_t *)dest_buff, dest_size, (u8_t *)src_buff, src_end_pos);           
        break;       
#endif

    default:            
        result = 0;
        break;
    }
	
    return result;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_convert_to_native_ucs2
 * DESCRIPTION
 *  Convert string from 1 character set to native (LE) UCS2 . (will add the terminate character)
 * PARAMETERS
 *  src_type        [IN]        Charset type of source
 *  src_buff        [IN]        Buffer stores source string
 *  dest_buff       [OUT]       Buffer stores destination string
 *  dest_size       [IN]        Size of destination buffer (bytes)
 *  src_end_pos     [OUT]       
 * RETURNS
 *  Length of destination string, including null terminator. (bytes)
 *****************************************************************************/
static s32_t mmi_chset_convert_to_native_ucs2(
            ENUM_MMI_CHSET src_type,
            u8_t *src_buff,
            u8_t *dest_buff,
            s32_t dest_size,
            u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    s32_t result;
    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    switch(src_type)
    {

