duxinglang-1/nRF9160_test/AURI_TEST/src/codetrans/codetrans.c
    case MMI_CHSET_ASCII:
        result = mmi_chset_ascii_to_ucs2(dest_buff, src_buff, dest_size, src_end_pos);
        break;

    case MMI_CHSET_UTF8:            
        result = mmi_chset_utf8_to_ucs2_string_ex(
            dest_buff,
            dest_size,
            src_buff,
            src_end_pos);	
        break;

    case MMI_CHSET_UTF16LE:
        result = mmi_chset_utf16_to_ucs2_string(
            dest_buff,
            dest_size,
            src_buff,
            MMI_CHSET_UTF16LE,
            src_end_pos);
        break;

    case MMI_CHSET_UTF16BE:
        result = mmi_chset_utf16_to_ucs2_string(
            dest_buff,
            dest_size,
            src_buff,
            MMI_CHSET_UTF16BE,
            src_end_pos);
        break;

#ifdef __MMI_CHSET_BIG5__            
	case MMI_CHSET_BIG5:
		result = mmi_chset_encode_decode_algo2(BIG5_TO_UCS2, dest_buff, src_buff, dest_size, src_end_pos);	  /* Length is hardcode for now to maximum */
		break;
#endif 

#ifdef __MMI_CHSET_GB2312__
    case MMI_CHSET_GB2312:            
        result = mmi_chset_encode_decode_algo2(GB2312_TO_UCS2, dest_buff, src_buff, dest_size, src_end_pos);    /* Length is hardcode for now to maximum */
        break;
#endif

#ifdef __MMI_CHSET_HKSCS__            
    case MMI_CHSET_HKSCS:            
        result = mmi_chset_encode_decode_algo2(HKSCS_TO_UCS2, dest_buff, src_buff, dest_size, src_end_pos);    /* Length is hardcode for now to maximum */
        break;
#endif

#ifdef __MMI_CHSET_UTF7__
    case MMI_CHSET_UTF7:
        result = mmi_chset_utf7_to_ucs2_str(dest_buff, src_buff, dest_size, src_end_pos);
        break;       
#endif

#ifdef __MMI_CHSET_GB18030__
    case MMI_CHSET_GB18030:
        result = mmi_chset_gb18030_to_ucs2_str(dest_buff, src_buff, dest_size, src_end_pos);
        break;          
#endif

#ifdef __MMI_CHSET_SJIS__
    case MMI_CHSET_SJIS:
        result = mmi_chset_sjis_to_ucs2((u8_t *)dest_buff, dest_size, (u8_t *)src_buff, src_end_pos);
        break;       
#endif

        /* For all rest of the encodings. */                
    default:            
        result = 0;
		break;
    }
	
    return result;
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_convert_ex
 * DESCRIPTION
 *  Convert string between 2 character sets. (will add the terminate character)
 * PARAMETERS
 *  src_type        [IN]        Charset type of source
 *  dest_type       [IN]        Charset type of destination
 *  src_buff        [IN]        Buffer stores source string
 *  dest_buff       [OUT]       Buffer stores destination string
 *  dest_size       [IN]        Size of destination buffer (bytes)
 *  src_end_pos     [OUT]       
 * RETURNS
 *  Length of destination string, including null terminator. (bytes)
 *****************************************************************************/
s32_t mmi_chset_convert_ex(
                               ENUM_MMI_CHSET src_type,
                               ENUM_MMI_CHSET dest_type,
                               char *src_buff,
                               char *dest_buff,
                               s32_t dest_size,
                               u32_t *src_end_pos)
{
    /*----------------------------------------------------------------*/
    /* Local Variables												  */
    /*----------------------------------------------------------------*/
    /* typecast buffer to safer types */
    u8_t *src_buff_int = (u8_t *)src_buff; 
    u8_t *dest_buff_int = (u8_t *)dest_buff;
    /*----------------------------------------------------------------*/
    /* Code Body													  */
    /*----------------------------------------------------------------*/

    *src_end_pos = (u32_t)src_buff_int;

    /* unsupported charset */
    if(src_type >= MMI_CHSET_TOTAL || dest_type >= MMI_CHSET_TOTAL)
    {
        return 0;
    }

    if(src_type == dest_type)
    {
        return mmi_chset_copy_to_dest(src_type, src_buff_int, dest_buff_int, dest_size, src_end_pos);
    }

    if(g_chset_state[src_type] == 0) /* If source type is disabled, but is 8 bit based simple code page*/
    {
        if (src_type <= MMI_CHSET_WESTERN_WIN)
        {
            return mmi_chset_simple_convert(dest_buff_int, dest_size, src_buff_int, src_end_pos); 		
        }
        else
        {
            return 0;
        }
    }

    if (g_chset_state[dest_type] == 0)
    {
        return 0;
    }

    if(src_type == MMI_CHSET_UCS2 )
    {
        return mmi_chset_convert_from_native_ucs2(dest_type, src_buff_int, dest_buff_int, dest_size, src_end_pos );
    }
    else if(dest_type == MMI_CHSET_UCS2 )
    {
        return mmi_chset_convert_to_native_ucs2(src_type, src_buff_int, dest_buff_int, dest_size, src_end_pos );									 
    }					
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_convert
 * DESCRIPTION
 *  Convert string between 2 character sets. (will add the terminate character)
 * PARAMETERS
 *  src_type        [IN]        Charset type of source
 *  dest_type       [IN]        Charset type of destination
 *  src_buff        [IN]        Buffer stores source string
 *  dest_buff       [OUT]       Buffer stores destination string
 *  dest_size       [IN]        Size of destination buffer (bytes)
 * RETURNS
 *  Length of destination string, including null terminator. (bytes)
 *****************************************************************************/
s32_t mmi_chset_convert(
            ENUM_MMI_CHSET src_type,
            ENUM_MMI_CHSET dest_type,
            char *src_buff,
            char *dest_buff,
            s32_t dest_size)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
    u32_t src_end_pos = (u32_t)src_buff;

    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
    return mmi_chset_convert_ex(src_type, dest_type, src_buff, dest_buff, dest_size, &src_end_pos);
}

/*****************************************************************************
 * FUNCTION
 *  mmi_chset_init
 * DESCRIPTION
 *  Routine for initializing the related data structures of the various encoding types
 * PARAMETERS
 *  void
 * RETURNS
 *  void
 *****************************************************************************/
void mmi_chset_init(void)
{
    /*----------------------------------------------------------------*/
    /* Local Variables                                                */
    /*----------------------------------------------------------------*/
	
    /*----------------------------------------------------------------*/
    /* Code Body                                                      */
    /*----------------------------------------------------------------*/
#ifdef __MMI_CHSET_BIG5__
	{
		static mmi_chset_info_struct big5_ucs2_tbl = {0};
		static mmi_chset_info_struct ucs2_big5_tbl = {0};
		
		big5_ucs2_tbl.Input_word_bits = CHSET_BIT_WORD_16;
		big5_ucs2_tbl.Output_word_bits = CHSET_BIT_WORD_16;
		big5_ucs2_tbl.UndefChar = 0xFF1F;
		g_chset_tbl[BIG5_TO_UCS2] = &big5_ucs2_tbl;
		
		ucs2_big5_tbl.Input_word_bits = CHSET_BIT_WORD_16;
		ucs2_big5_tbl.Output_word_bits = CHSET_BIT_WORD_16;
		ucs2_big5_tbl.UndefChar = 0xA148;
		g_chset_tbl[UCS2_TO_BIG5] = &ucs2_big5_tbl;
	}
#endif /* __MMI_CHSET_BIG5__ */ 

#if defined(__MMI_CHSET_GB2312__) || defined(__MMI_CHSET_HKSCS__)
	{
		static mmi_chset_info_struct chinese_common_ucs2_tbl = {0};
		static mmi_chset_info_struct ucs2_chinese_common_tbl = {0};
		
		chinese_common_ucs2_tbl.Input_word_bits = CHSET_BIT_WORD_16;
		chinese_common_ucs2_tbl.Output_word_bits = CHSET_BIT_WORD_16;
		chinese_common_ucs2_tbl.UndefChar = 0xFF1F;		
		
		ucs2_chinese_common_tbl.Input_word_bits = CHSET_BIT_WORD_16;
		ucs2_chinese_common_tbl.Output_word_bits = CHSET_BIT_WORD_16;
		ucs2_chinese_common_tbl.UndefChar = 0x233F;

#ifdef __MMI_CHSET_GB2312__
		g_chset_tbl[GB2312_TO_UCS2] = &chinese_common_ucs2_tbl;
		g_chset_tbl[UCS2_TO_GB2312] = &ucs2_chinese_common_tbl;
#endif
#ifdef __MMI_CHSET_HKSCS__
        g_chset_tbl[HKSCS_TO_UCS2] = &chinese_common_ucs2_tbl;
        g_chset_tbl[UCS2_TO_HKSCS] = &ucs2_chinese_common_tbl;
#endif
	}
#endif /* __MMI_CHSET_GB2312__ || __MMI_CHSET_HKSCS__ */ 

#ifdef __MMI_CHSET_WESTERN_WIN__
	{
	    static mmi_chset_info_struct western_win_ucs2_tbl;
		static mmi_chset_info_struct ucs2_western_win_tbl;

		western_win_ucs2_tbl.pConversnTable = NULL;		
	    western_win_ucs2_tbl.pMappingTable = &g_chset_map_western_win_ucs2[0];
	    western_win_ucs2_tbl.TotalMapTbIndex = mmi_chset_map_western_win_ucs2_size();
		western_win_ucs2_tbl.Input_word_bits = CHSET_BIT_WORD_8;
		western_win_ucs2_tbl.Output_word_bits = CHSET_BIT_WORD_16;
		western_win_ucs2_tbl.UndefChar = 0x003F;
	    g_chset_tbl[WESTERN_WINDOWS_TO_UCS2] = &western_win_ucs2_tbl;


		ucs2_western_win_tbl.pConversnTable = NULL; 
	    ucs2_western_win_tbl.pMappingTable = &g_chset_map_ucs2_western_win[0];
	    ucs2_western_win_tbl.TotalMapTbIndex = mmi_chset_map_ucs2_western_win_size();
		ucs2_western_win_tbl.Input_word_bits = CHSET_BIT_WORD_16;
		ucs2_western_win_tbl.Output_word_bits = CHSET_BIT_WORD_8;
		ucs2_western_win_tbl.UndefChar = 0x3F;
		g_chset_tbl[UCS2_TO_WESTERN_WINDOWS] = &ucs2_western_win_tbl;
	}
#endif /* __MMI_CHSET_WESTERN_WIN__ */ 


    g_chset_tbl_is_init = true;
}

